---1. Напишете заявка, която извежда модел, честота и размер на диска за
---всички персонални компютри с цена под 1200 долара. Задайте
---псевдоними за атрибутите честота и размер на диска, съответно MHz и GB
SELECT model, speed AS MHz, hd AS GB
FROM pc
WHERE pc.price < 1200;

---2. Напишете заявка, която извежда производителите на принтери без
---повторения
SELECT DISTINCT maker
FROM product
WHERE type = 'Printer';

---3. Напишете заявка, която извежда модел, размер на паметта, размер на
---екран за лаптопите, чиято цена е над 1000 долара
SELECT model, RAM, SCREEN
FROM laptop
WHERE price > 1000;

---4. Напишете заявка, която извежда всички цветни принтери
SELECT *
FROM Printer
WHERE color = 'Y';

---5. Напишете заявка, която извежда модел, честота и размер на диска за
---тези персонални компютри със CD 12x или 16x и цена под 2000 долара.
SELECT model, speed, hd
FROM pc
WHERE (CD = '12x' OR CD = '16x') AND price < 2000;
