USE master
GO
USE ships
GO

--1. Напишете заявка, която извежда цялата налична информация за всеки
--кораб, включително и данните за неговия клас. В резултата не трябва да
--се включват тези класове, които нямат кораби.
SELECT *
FROM SHIPS RIGHT OUTER JOIN CLASSES
ON SHIPS.CLASS = CLASSES.CLASS
WHERE SHIPS.CLASS IS NOT NULL;

--2. Повторете горната заявка, като този път включите в резултата и класовете,
--които нямат кораби, но съществуват кораби със същото име като тяхното.
SELECT *
FROM SHIPS RIGHT OUTER JOIN CLASSES
ON SHIPS.CLASS = CLASSES.CLASS AND SHIPS.NAME IN (SELECT SHIPS.NAME
FROM SHIPS);

--3. За всяка страна изведете имената на корабите, които никога не са
--участвали в битка.

--4. Намерете имената на всички кораби с поне 7 оръдия, пуснати на вода през
--1916, но наречете резултатната колона Ship Name.

--5. Изведете имената на всички потънали в битка кораби, името и дата на
--провеждане на битките, в които те са потънали. Подредете резултата по
--име на битката.

--6. Намерете името, водоизместимостта и годината на пускане на вода на
--всички кораби, които имат същото име като техния клас.

--7. Намерете всички класове кораби, от които няма пуснат на вода нито един
--кораб.

--8. Изведете името, водоизместимостта и броя оръдия на корабите,
--участвали в битката ‘North Atlantic’, а също и резултата от битката.
